app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test article"], ["content", "hello world "], ["created_at", "2018-05-06 23:48:16.311668"], ["updated_at", "2018-05-06 23:48:16.311668"]]
---
  def create
  	@article = Article.new(article_params)
  	@article.save

UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "It's 42"], ["updated_at", "2018-05-07 01:40:56.415783"], ["id", 1]]
---
  def update
  	@article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def article_id
  	@article = Article.find(params[:id])